CFD/IBF_CFD/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

vertices
(
    (-3 -6 -1)
    (3 -6 -1)
    (3  4 -1)
    (-3  4 -1)
    (-3 -6 1)
    (3 -6 1)
    (3  4 1)
    (-3  4 1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (24 40 8) simpleGrading (1 1 1)
);

boundary
(
    front
    {
        type symmetryPlane;
        faces
        (
            (0 4 7 3)
            // (3 7 6 2)
        );
    }
    back
    {
        type symmetryPlane;
        faces
        (
            (2 6 5 1)
            // (1 5 4 0)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (1 5 4 0)
            // (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (3 7 6 2)
            // (2 6 5 1)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (4 5 6 7)
            // (0 3 2 1)
        );
    }
    upperWall
    {
        type symmetryPlane;
        faces
        (
            (0 3 2 1)
            // (4 5 6 7)
        );
    }
);

// ************************************************************************* //
