CFD/IBF_CFD/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    front
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          320;
        startFace       21568;
    }
    back
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          320;
        startFace       21888;
    }
    inlet
    {
        type            patch;
        nFaces          192;
        startFace       22208;
    }
    outlet
    {
        type            patch;
        nFaces          192;
        startFace       22400;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          960;
        startFace       22592;
    }
    upperWall
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          960;
        startFace       23552;
    }
)

// ************************************************************************* //
