CFD/IBF_CFD/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


/*
k (turbulent kinetic energy) = 3/2 (U_avg * I)^2 where U_avg is avg. velocity (found in U file) and I is turbulence intensity (~1-5%)
*/
internalField   uniform 0.24; /* Change this */

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.24; /* Change this */
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.24; /* Change this */
        value           uniform 0.24; /* Change this */
    }
    lowerWall
    {
        type            kqRWallFunction;
        value           uniform 0.24; /* Change this */
    }
    "IBF_.*"
    {
        type            kqRWallFunction;
        value           uniform 0.24; /* Change this */
    }
    upperWall
    {
        type            symmetryPlane;
    }
    "(front|back)"
    {
        type            symmetryPlane;
    }
    "proc.*"
    {
        type            processor;
    }
}


// ************************************************************************* //
