CFD/IBF_CFD/0/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];


/* 
nuTilda can be approximated as 0.1 * v where v is the kinematic viscosity and at STP 1.5*10^(-5) m^2/s 
*/
internalField   uniform 0.05; 

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.05; /* Change this */
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.05; /* Change this */
        value           uniform 0.05; /* Change this */
    }
    lowerWall
    {
        type            fixedValue;
        value           uniform 0;
    }
    "IBF_.*"
    {
        type            fixedValue;
        value           uniform 0;
    }
    upperWall
    {
        type            symmetryPlane;
    }
    "(front|back)"
    {
        type            symmetryPlane;
    }
    "proc.*"
    {
        type            processor;
    }
}


// ************************************************************************* //
